In [1]:
import pandas as pd
import numpy as np

In [7]:
df=pd.read_csv("C:/Users/User/Downloads/employees.csv")
df

    First Name  Gender  Salary Bonus % Senior Management                  Team
0      Douglas    Male   97308   6.945              TRUE             Marketing
1       Thomas    Male   61933     NaN              TRUE                   NaN
2        Maria  Female  130590  11.858             FALSE               Finance
3        Jerry    Male     NaN    9.34              TRUE               Finance
4        Larry    Male  101004   1.389              TRUE       Client Services
..         ...     ...     ...     ...               ...                   ...
995      Henry     NaN  132483  16.655             FALSE          Distribution
996    Phillip    Male   42392  19.675             FALSE               Finance
997    Russell    Male   96914   1.421             FALSE               Product
998      Larry    Male   60500  11.985             FALSE  Business Development
999     Albert    Male  129949  10.169              TRUE                 Sales

[1000 rows x 6 columns]

In [8]:
print(df.dtypes)
print(df.describe())

First Name           object
Gender               object
Salary               object
Bonus %              object
Senior Management    object
Team                 object
dtype: object
       First Name  Gender Salary Bonus % Senior Management             Team
count         931     852    998     997               932              957
unique        201       3    993     968                 4               13
top       Marilyn  Female  91462   8.999              TRUE  Client Services
freq           11     428      2       3               467              105

In [10]:
print('Salary')
print(df['Salary'].head(10))

Salary
0     97308
1     61933
2    130590
3       NaN
4    101004
5    115163
6     65476
7     45906
8       NaN
9    139852
Name: Salary, dtype: object

In [11]:
print(df['Gender'].head(10))

0      Male
1      Male
2    Female
3      Male
4      Male
5      n.a.
6    Female
7    Female
8       NaN
9    Female
Name: Gender, dtype: object

In [15]:
missing_value_formats=["n.a.","?","NA","n/a","na","--"]
df=pd.read_csv("C:/Users/User/Downloads/employees.csv",na_values=missing_value_formats)
print(df['Gender'].head(10))

0      Male
1      Male
2    Female
3      Male
4      Male
5       NaN
6    Female
7    Female
8       NaN
9    Female
Name: Gender, dtype: object

In [22]:
import pandas as pd
missing_value_formats=["n.a.","?","NA","n/a","na","--"]
df=pd.read_csv("C:/Users/User/Downloads/employees.csv",na_values=missing_value_formats)

def make_int(i):
    try:
        return int (i)
    except:
        return pd.np.nan
    df['Salary']=df['Salary'].map(make_int)

In [23]:

    print(df['Salary'].head())

0     97308.0
1     61933.0
2    130590.0
3         NaN
4    101004.0
Name: Salary, dtype: float64

In [24]:
print(df['Gender'].isnull().head(10))
print(df['Gender'].notnull().head(10))

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8     True
9    False
Name: Gender, dtype: bool
0     True
1     True
2     True
3     True
4     True
5    False
6     True
7     True
8    False
9     True
Name: Gender, dtype: bool

In [25]:
null_filter=df["Gender"].notnull()
print(df[null_filter].head())

  First Name  Gender    Salary  Bonus % Senior Management             Team
0    Douglas    Male   97308.0    6.945              True        Marketing
1     Thomas    Male   61933.0      NaN              True              NaN
2      Maria  Female  130590.0   11.858             False          Finance
3      Jerry    Male       NaN    9.340              True          Finance
4      Larry    Male  101004.0    1.389              True  Client Services

In [26]:
print(df.isnull().values.any())

True

In [27]:
print(df.isnull().sum())

First Name            70
Gender               149
Salary                 5
Bonus %                4
Senior Management     71
Team                  48
dtype: int64

In [28]:
new_df=df.dropna(axis=0)
print(new_df.isnull().values.any())

False

In [31]:
new_df=df.dropna(axis=0,how='any')

print(new_df)

    First Name  Gender    Salary  Bonus % Senior Management  \
0      Douglas    Male   97308.0    6.945              True
2        Maria  Female  130590.0   11.858             False
4        Larry    Male  101004.0    1.389              True
6         Ruby  Female   65476.0   10.012              True
9      Frances  Female  139852.0    7.524              True
..         ...     ...       ...      ...               ...
994     George    Male   98874.0    4.479              True
996    Phillip    Male   42392.0   19.675             False
997    Russell    Male   96914.0    1.421             False
998      Larry    Male   60500.0   11.985             False
999     Albert    Male  129949.0   10.169              True

                     Team
0               Marketing
2                 Finance
4         Client Services
6                 Product
9    Business Development
..                    ...
994             Marketing
996               Finance
997               Product
998  Business Development
999                 Sales

[742 rows x 6 columns]

In [34]:
new_df=df.dropna(axis=0,how='all')
print(new_df)

    First Name  Gender    Salary  Bonus % Senior Management  \
0      Douglas    Male   97308.0    6.945              True
1       Thomas    Male   61933.0      NaN              True
2        Maria  Female  130590.0   11.858             False
3        Jerry    Male       NaN    9.340              True
4        Larry    Male  101004.0    1.389              True
..         ...     ...       ...      ...               ...
995      Henry     NaN  132483.0   16.655             False
996    Phillip    Male   42392.0   19.675             False
997    Russell    Male   96914.0    1.421             False
998      Larry    Male   60500.0   11.985             False
999     Albert    Male  129949.0   10.169              True

                     Team
0               Marketing
1                     NaN
2                 Finance
3                 Finance
4         Client Services
..                    ...
995          Distribution
996               Finance
997               Product
998  Business Development
999                 Sales

[1000 rows x 6 columns]

In [35]:
new_df=df.dropna(axis=1,how='any') 
print(new_df)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, ...]

[1000 rows x 0 columns]

In [36]:
new_df=df.dropna(axis=1,how='all')  
print(new_df)

    First Name  Gender    Salary  Bonus % Senior Management  \
0      Douglas    Male   97308.0    6.945              True
1       Thomas    Male   61933.0      NaN              True
2        Maria  Female  130590.0   11.858             False
3        Jerry    Male       NaN    9.340              True
4        Larry    Male  101004.0    1.389              True
..         ...     ...       ...      ...               ...
995      Henry     NaN  132483.0   16.655             False
996    Phillip    Male   42392.0   19.675             False
997    Russell    Male   96914.0    1.421             False
998      Larry    Male   60500.0   11.985             False
999     Albert    Male  129949.0   10.169              True

                     Team
0               Marketing
1                     NaN
2                 Finance
3                 Finance
4         Client Services
..                    ...
995          Distribution
996               Finance
997               Product
998  Business Development
999                 Sales

[1000 rows x 6 columns]

In [37]:
df['Salary'].fillna(method='pad')

0       97308.0
1       61933.0
2      130590.0
3      130590.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64

In [38]:
df['Salary'].fillna(method='bfill')

0       97308.0
1       61933.0
2      130590.0
3      101004.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64

In [40]:
df['Salary'].fillna(df['Salary'].median())

0       97308.0
1       61933.0
2      130590.0
3       90370.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64

In [41]:
df['Salary'].fillna(int(df['Salary'].mean()))

0       97308.0
1       61933.0
2      130590.0
3       90522.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64

In [42]:
df['Salary'].replace(to_replace=np.nan,value=0)

0       97308.0
1       61933.0
2      130590.0
3           0.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64

In [43]:
df['Salary'].interpolate(method="linear",direction="forward")

0       97308.0
1       61933.0
2      130590.0
3      115797.0
4      101004.0
         ...
995    132483.0
996     42392.0
997     96914.0
998     60500.0
999    129949.0
Name: Salary, Length: 1000, dtype: float64